CFD Projects/Channel Flow/CFD_ChannelFlow_Project/turbulentChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  blockMeshDict - Turbulent Channel Flow (half-domain, symmetry at centreline)
\*----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ----- Geometry parameters (edit here only) -----
L   3.0;     // channel length [m]   (same domain as laminar case)
h   0.01;    // HALF channel height [m]
t   0.01;    // arbitrary depth, irrelevant (2D, empty patches)

scale 1;

vertices
(
    (0    0   0)   // 0
    ($L   0   0)   // 1
    ($L  $h   0)   // 2
    (0   $h   0)   // 3
    (0    0  $t)   // 4
    ($L   0  $t)   // 5
    ($L  $h  $t)   // 6
    (0   $h  $t)   // 7
);

blocks
(
    // 200 x 100 cells. grading (1 0.05 1): strong clustering toward the
    // wall (y=h) so the first cell sits near yPlus ~ 30-50 for wall functions.
    // CHECK yPlus after a run (postProcess -func yPlus) and tighten/relax
    // this number if it falls outside roughly 30-300.
    hex (0 1 2 3 4 5 6 7) (200 100 1) simpleGrading (1 0.05 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
