CFD Projects/Channel Flow/CFD_ChannelFlow_Project/turbulentChannel/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

// Air at ~20 C  (same fluid as laminar case)
nu              [0 2 -1 0 0 0 0] 1.5e-05;
