CFD Projects/Channel Flow/CFD_ChannelFlow_Project/turbulentChannel/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

// Inlet mean velocity for Re_Dh = 20000: U = Re*nu/Dh = 20000*1.5e-5/0.04
internalField   uniform (7.5 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (7.5 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            noSlip;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}
